In [39]:
import pandas as pd
from typing import List

## 183 Customers who never order

In [18]:
customerDf = pd.DataFrame({"id":[1,2,3,4],
                           'name': ['Joe','Henry','Sam','Max']})

orderDf = pd.DataFrame({'id':[1,2],
                        'customerId':[3,1]})

display(customerDf)
display(orderDf)

def find_customers(customers: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    customers.rename(columns={'id':'customerId'},inplace=True)
    df = pd.merge(customers, orders, on = "customerId", how="left")
    df = df[df.isna().any(axis=1)]
    df.rename(columns={'name':'Customers'},inplace=True)
    return df[['Customers']]

display(find_customers(customerDf, orderDf))

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

   id  customerId
0   1           3
1   2           1

  Customers
1     Henry
3       Max

## 1148 Article views 1

In [31]:
def article_views(views: pd.DataFrame) -> pd.DataFrame:
    df = views[views['author_id'] == views['viewer_id']]
    df = pd.DataFrame({'id':df['author_id'].unique()})
    df.sort_values(by='id',ascending=True,inplace=True)
    return df

viewDf = pd.DataFrame({"article_id":[1,1,2,2,4,3,3],
                       "author_id": [3,3,7,7,7,4,4],
                       'viewer_id': [5,6,7,6,1,4,4]})

display(viewDf)
display(article_views(viewDf))

   article_id  author_id  viewer_id
0           1          3          5
1           1          3          6
2           2          7          7
3           2          7          6
4           4          7          1
5           3          4          4
6           3          4          4

   id
1   4
0   7

## 1683 Invalid tweets

In [47]:
def invalid_tweets(tweets: pd.DataFrame) -> pd.DataFrame:
    df = tweets[tweets['content'].str.len() > 15]
    return df[['tweet_id']]


tweet = pd.DataFrame({
    'tweet_id':[1,2],
    'content':["Vote for Biden", "Let us make America great again!"]
})

display(invalid_tweets(tweet))

   tweet_id
1         2

## 1768 Merge strings alternately

In [36]:
def mergeAlternately(word1: str, word2: str) -> str:
    i = 0
    j = 0
    result = ''
    while i < len(word1) and j < len(word2):
        result += word1[i] + word2[j]
        i += 1
        j += 1
    result += word1[i:] + word2[j:]

    return result

word1 = "abcd"
word2 = "pq"
print(mergeAlternately(word1,word2))

apbqcd

## 1873 Calculate special bonus

In [58]:
def calculate_special_bonus(employees: pd.DataFrame) -> pd.DataFrame:
    employees['bonus'] = 0
    condition = (employees['employee_id'] % 2 == 1) & (employees['name'].str[0] != 'M')
    employees.loc[condition,'bonus']= employees['salary']
    # Then order by id
    employees.sort_values(by="employee_id",inplace=True)
    return employees[['employee_id','bonus']]


employeeDf = pd.DataFrame({'employee_id': [2,3,9,8,7],
                           'name':['Meir','Michael','Addilyn','Juan', 'Kannon'],
                           'salary':[3000,3800,7400,6100,7700]})

display(calculate_special_bonus(employeeDf))
print(employeeDf['name'].str[0])

   employee_id  bonus
0            2      0
1            3      0
2            9   7400
3            8      0
4            7   7700

0    M
1    M
2    A
3    J
4    K
Name: name, dtype: object

## 1667 Fix names in a table

In [80]:
def fix_names(users: pd.DataFrame) -> pd.DataFrame:
    users['name'] = users['name'].str.lower()
    users['name'] = users['name'].str.capitalize()
    users.sort_values(by='user_id',inplace=True)
    return users

nameDt = pd.DataFrame({'user_id': [2,3,9,8,7],
                        'name':['Meir','michAel','aDDilyn','Juan', 'Kannon']})
display(fix_names(nameDt))

   user_id     name
0        2     Meir
1        3  Michael
4        7   Kannon
3        8     Juan
2        9  Addilyn

## 1517 Find users with valid emails

In [88]:

def valid_emails(users: pd.DataFrame) -> pd.DataFrame:
    valid_emails_df = users[users['mail'].str.match(r'^[A-Za-z][A-Za-z0-9_\.\-]*@leetcode(\?com)?\.com$')]
    return valid_emails_df

users_data = pd.DataFrame({
    'user_id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'mail': ['alic#e@leetcode.com', 'bob1/23@leetcode.com', 'charlie@example.com', 'david@leetcode.com']
})
valid_emails(users_data)

   user_id   name                mail
3        4  David  david@leetcode.com

## 1527 Patients with a condition

In [96]:
def find_patients(patients: pd.DataFrame) -> pd.DataFrame:
    df = patients[patients['conditions'].str.contains(r'\bDIAB1')]
    return df

## 2738 Count occurrences in text

In [99]:
def count_occurrences(files: pd.DataFrame) -> pd.DataFrame:
    df = pd.DataFrame({'word':['bull','bear'],
                       'count': [
                           (files['content'].str.contains(r'\sbull\s',case=False,regex = True).sum()),
                           (files['content'].str.contains(r'\sbear\s',case=False,regex=True).sum())
                       ]})
    return df

## 1769 Minimum number of operations to move all balls to one box

In [97]:
def minOperations(boxes: str) -> List[int]:
    n = len(boxes)
    total_ops = [0] * n
    for i in range(n):
        for j in range(n):
            if i!=j:
                if int(boxes[j]) > 0:
                    total_ops[i] += abs(i-j)
    return total_ops



box1 = "110"
display(minOperations(box1))

box2 = "001011"
display(minOperations(box2))

[1, 1, 3]

[11, 8, 5, 4, 3, 4]

In [98]:
my_range = range(-1)
print(list(my_range))

[]